#9095

T = int(input())

"""
귀납적으로 규칙 파악 및 알고리즘 세우기 

n=1 > 1 
n=2 > 2
n=3 > 3 
n=4 > 7가지 
n=5 
(1+1+1+1+1), (1+1+1+2), (1+1+3), (2+3)
(1+1+2+1), (1+2+1+1), (2+1+1+1), (1+3+1), (3+1+1), (3+2)
(1+2+2), (2+1+2), (2+2+1)
> 13 

>>> 이전 n의 합
n일 때 값은 n-1 일 때, n-2 일 때, n-3 일 때 각각의 총합과 같다. 
따라서 재귀적으로 코드를 세워야 한다. 
"""
def func(n) :
  if (n==1) : return 1
  elif (n==2): return 2
  elif (n==3): return 4
  else : 
    return func(n-1) + func(n-2) + func(n-3) 

for i in range(T) :
    n = int(input())
    print(func(n)) 

